bigtreetech/BIGTREETECH-OCTOPUS-V1.0/Firmware/RepRapFirmware/RRFBuild-SourceCode/CoreN2G/src/atmel/SAME51_DFP/1.1.139/atdf/ATSAME51G19A.atdf
        <module name="SUPC" id="U2407" version="1.1.0">
          <instance name="SUPC">
            <register-group name="SUPC" name-in-module="SUPC" address-space="base" offset="0x40001800"/>
            <signals>
              <signal group="OUT" index="1" function="SUPC" pad="PB02" ioset="1"/>
              <signal group="VBAT" function="SUPC" pad="PB03" ioset="1"/>
            </signals>
            <parameters>
              <param name="BOD12_CALIB_MSB" value="5"/>
              <param name="BOD33_CALIB_MSB" value="5"/>
              <param name="INSTANCE_ID" value="6"/>
            </parameters>
          </instance>
        </module>
        <module name="TC" id="U2249" version="3.0.0">
          <instance name="TC0">
            <register-group name="TC0" name-in-module="TC" address-space="base" offset="0x40003800"/>
            <signals>
              <signal group="WO" index="0" function="E" pad="PA04" ioset="1"/>
              <signal group="WO" index="0" function="E" pad="PA08" ioset="2"/>
              <signal group="WO" index="1" function="E" pad="PA05" ioset="1"/>
              <signal group="WO" index="1" function="E" pad="PA09" ioset="2"/>
            </signals>
            <parameters>
              <param name="CC_NUM" value="2"/>
              <param name="DMAC_ID_OVF" value="44" caption="Indexes of DMA Overflow trigger"/>
              <param name="DMAC_ID_MC0" value="45" caption="Indexes of DMA Match/Compare 0 trigger"/>
              <param name="DMAC_ID_MC1" value="46" caption="Indexes of DMA Match/Compare 1 trigger"/>
              <param name="EXT" value="0" caption="Coding of implemented extended features (keep 0 value)"/>
              <param name="GCLK_ID" value="9" caption="Index of Generic Clock"/>
              <param name="MASTER_SLAVE_MODE" value="1" caption="TC type 0 : NA, 1 : Master, 2 : Slave"/>
              <param name="OW_NUM" value="2" caption="Number of Output Waveforms"/>
              <param name="INSTANCE_ID" value="14"/>
            </parameters>
          </instance>
          <instance name="TC1">
            <register-group name="TC1" name-in-module="TC" address-space="base" offset="0x40003C00"/>
            <signals>
              <signal group="WO" index="0" function="E" pad="PA06" ioset="1"/>
              <signal group="WO" index="0" function="E" pad="PA10" ioset="2"/>
              <signal group="WO" index="1" function="E" pad="PA07" ioset="1"/>
              <signal group="WO" index="1" function="E" pad="PA11" ioset="2"/>
            </signals>
            <parameters>
              <param name="CC_NUM" value="2"/>
              <param name="DMAC_ID_OVF" value="47" caption="Indexes of DMA Overflow trigger"/>
              <param name="DMAC_ID_MC0" value="48" caption="Indexes of DMA Match/Compare 0 trigger"/>
              <param name="DMAC_ID_MC1" value="49" caption="Indexes of DMA Match/Compare 1 trigger"/>
              <param name="EXT" value="0" caption="Coding of implemented extended features (keep 0 value)"/>
              <param name="GCLK_ID" value="9" caption="Index of Generic Clock"/>
              <param name="MASTER_SLAVE_MODE" value="2" caption="TC type 0 : NA, 1 : Master, 2 : Slave"/>
              <param name="OW_NUM" value="2" caption="Number of Output Waveforms"/>
              <param name="INSTANCE_ID" value="15"/>
            </parameters>
          </instance>
          <instance name="TC2">
            <register-group name="TC2" name-in-module="TC" address-space="base" offset="0x4101A000"/>
            <signals>
              <signal group="WO" index="0" function="E" pad="PA12" ioset="2"/>
              <signal group="WO" index="0" function="E" pad="PA16" ioset="3"/>
              <signal group="WO" index="0" function="E" pad="PA00" ioset="1"/>
              <signal group="WO" index="1" function="E" pad="PA01" ioset="1"/>
              <signal group="WO" index="1" function="E" pad="PA13" ioset="2"/>
              <signal group="WO" index="1" function="E" pad="PA17" ioset="3"/>
            </signals>
            <parameters>
              <param name="CC_NUM" value="2"/>
              <param name="DMAC_ID_OVF" value="50" caption="Indexes of DMA Overflow trigger"/>
              <param name="DMAC_ID_MC0" value="51" caption="Indexes of DMA Match/Compare 0 trigger"/>
              <param name="DMAC_ID_MC1" value="52" caption="Indexes of DMA Match/Compare 1 trigger"/>
              <param name="EXT" value="0" caption="Coding of implemented extended features (keep 0 value)"/>
              <param name="GCLK_ID" value="26" caption="Index of Generic Clock"/>
              <param name="MASTER_SLAVE_MODE" value="1" caption="TC type 0 : NA, 1 : Master, 2 : Slave"/>
              <param name="OW_NUM" value="2" caption="Number of Output Waveforms"/>
              <param name="INSTANCE_ID" value="45"/>
            </parameters>
          </instance>
          <instance name="TC3">
            <register-group name="TC3" name-in-module="TC" address-space="base" offset="0x4101C000"/>
            <signals>
              <signal group="WO" index="0" function="E" pad="PA18" ioset="2"/>
              <signal group="WO" index="0" function="E" pad="PA14" ioset="1"/>
              <signal group="WO" index="1" function="E" pad="PA15" ioset="1"/>
              <signal group="WO" index="1" function="E" pad="PA19" ioset="2"/>
            </signals>
            <parameters>
              <param name="CC_NUM" value="2"/>
              <param name="DMAC_ID_OVF" value="53" caption="Indexes of DMA Overflow trigger"/>
              <param name="DMAC_ID_MC0" value="54" caption="Indexes of DMA Match/Compare 0 trigger"/>
              <param name="DMAC_ID_MC1" value="55" caption="Indexes of DMA Match/Compare 1 trigger"/>
              <param name="EXT" value="0" caption="Coding of implemented extended features (keep 0 value)"/>
              <param name="GCLK_ID" value="26" caption="Index of Generic Clock"/>
              <param name="MASTER_SLAVE_MODE" value="2" caption="TC type 0 : NA, 1 : Master, 2 : Slave"/>
              <param name="OW_NUM" value="2" caption="Number of Output Waveforms"/>
              <param name="INSTANCE_ID" value="46"/>
            </parameters>
          </instance>
        </module>
        <module name="TCC" id="U2213" version="3.1.0">
          <instance name="TCC0">
            <register-group name="TCC0" name-in-module="TCC" address-space="base" offset="0x41016000"/>
            <signals>
              <signal group="WO" index="0" function="G" pad="PA20" ioset="6"/>
              <signal group="WO" index="0" function="F" pad="PA08" ioset="1"/>
              <signal group="WO" index="1" function="G" pad="PA21" ioset="6"/>
              <signal group="WO" index="1" function="F" pad="PA09" ioset="1"/>
              <signal group="WO" index="2" function="G" pad="PA22" ioset="6"/>
              <signal group="WO" index="2" function="F" pad="PA10" ioset="1"/>
              <signal group="WO" index="3" function="G" pad="PA23" ioset="6"/>
              <signal group="WO" index="3" function="F" pad="PA11" ioset="1"/>
              <signal group="WO" index="4" function="G" pad="PA16" ioset="5"/>
              <signal group="WO" index="4" function="F" pad="PB10" ioset="1"/>
              <signal group="WO" index="5" function="G" pad="PA17" ioset="5"/>
              <signal group="WO" index="5" function="F" pad="PB11" ioset="1"/>
              <signal group="WO" index="6" function="G" pad="PA18" ioset="3"/>
              <signal group="WO" index="6" function="F" pad="PA12" ioset="1"/>
              <signal group="WO" index="7" function="G" pad="PA19" ioset="3"/>
              <signal group="WO" index="7" function="F" pad="PA13" ioset="1"/>
            </signals>
            <parameters>
              <param name="CC_NUM" value="6" caption="Number of Compare/Capture units"/>
              <param name="DITHERING" value="1" caption="Dithering feature implemented"/>
              <param name="DMAC_ID_OVF" value="22" caption="DMA overflow/underflow/retrigger trigger"/>
              <param name="DMAC_ID_MC0" value="23" caption="Indexes of DMA Match/Compare 0 trigger"/>
              <param name="DMAC_ID_MC1" value="24" caption="Indexes of DMA Match/Compare 1 trigger"/>
              <param name="DMAC_ID_MC2" value="25" caption="Indexes of DMA Match/Compare 2 trigger"/>
              <param name="DMAC_ID_MC3" value="26" caption="Indexes of DMA Match/Compare 3 trigger"/>
              <param name="DMAC_ID_MC4" value="27" caption="Indexes of DMA Match/Compare 4 trigger"/>
              <param name="DMAC_ID_MC5" value="28" caption="Indexes of DMA Match/Compare 5 trigger"/>
              <param name="DTI" value="1" caption="Dead-Time-Insertion feature implemented"/>
              <param name="EXT" value="31" caption="Coding of implemented extended features"/>
              <param name="GCLK_ID" value="25" caption="Index of Generic Clock"/>
              <param name="MASTER_SLAVE_MODE" value="1" caption="TCC type 0 : NA, 1 : Master, 2 : Slave"/>
              <param name="OTMX" value="1" caption="Output Matrix feature implemented"/>
              <param name="OW_NUM" value="8" caption="Number of Output Waveforms"/>
              <param name="PG" value="1" caption="Pattern Generation feature implemented"/>
              <param name="SIZE" value="24"/>
              <param name="SWAP" value="1" caption="DTI outputs swap feature implemented"/>
              <param name="INSTANCE_ID" value="43"/>
            </parameters>
          </instance>
          <instance name="TCC1">
            <register-group name="TCC1" name-in-module="TCC" address-space="base" offset="0x41018000"/>
            <signals>
              <signal group="WO" index="0" function="G" pad="PB10" ioset="4"/>
              <signal group="WO" index="0" function="F" pad="PA16" ioset="1"/>
              <signal group="WO" index="1" function="G" pad="PB11" ioset="4"/>
              <signal group="WO" index="1" function="F" pad="PA17" ioset="1"/>
              <signal group="WO" index="2" function="G" pad="PA12" ioset="4"/>
              <signal group="WO" index="2" function="G" pad="PA14" ioset="5"/>
              <signal group="WO" index="2" function="F" pad="PA18" ioset="1"/>
              <signal group="WO" index="3" function="G" pad="PA13" ioset="4"/>
              <signal group="WO" index="3" function="G" pad="PA15" ioset="5"/>
              <signal group="WO" index="3" function="F" pad="PA19" ioset="1"/>
              <signal group="WO" index="4" function="G" pad="PA08" ioset="3"/>
              <signal group="WO" index="4" function="F" pad="PA20" ioset="1"/>
              <signal group="WO" index="5" function="G" pad="PA09" ioset="3"/>
              <signal group="WO" index="5" function="F" pad="PA21" ioset="1"/>
              <signal group="WO" index="6" function="G" pad="PA10" ioset="2"/>
              <signal group="WO" index="6" function="F" pad="PA22" ioset="1"/>
              <signal group="WO" index="7" function="G" pad="PA11" ioset="2"/>
              <signal group="WO" index="7" function="F" pad="PA23" ioset="1"/>
            </signals>
            <parameters>
              <param name="CC_NUM" value="4" caption="Number of Compare/Capture units"/>
              <param name="DITHERING" value="1" caption="Dithering feature implemented"/>
              <param name="DMAC_ID_OVF" value="29" caption="DMA overflow/underflow/retrigger trigger"/>
              <param name="DMAC_ID_MC0" value="30" caption="Indexes of DMA Match/Compare 0 trigger"/>
              <param name="DMAC_ID_MC1" value="31" caption="Indexes of DMA Match/Compare 1 trigger"/>
              <param name="DMAC_ID_MC2" value="32" caption="Indexes of DMA Match/Compare 2 trigger"/>
              <param name="DMAC_ID_MC3" value="33" caption="Indexes of DMA Match/Compare 3 trigger"/>
              <param name="DTI" value="1" caption="Dead-Time-Insertion feature implemented"/>
              <param name="EXT" value="31" caption="Coding of implemented extended features"/>
              <param name="GCLK_ID" value="25" caption="Index of Generic Clock"/>
              <param name="MASTER_SLAVE_MODE" value="2" caption="TCC type 0 : NA, 1 : Master, 2 : Slave"/>
              <param name="OTMX" value="1" caption="Output Matrix feature implemented"/>
              <param name="OW_NUM" value="8" caption="Number of Output Waveforms"/>
              <param name="PG" value="1" caption="Pattern Generation feature implemented"/>
              <param name="SIZE" value="24"/>
              <param name="SWAP" value="1" caption="DTI outputs swap feature implemented"/>
              <param name="INSTANCE_ID" value="44"/>
            </parameters>
          </instance>
