bigtreetech/BIGTREETECH-OCTOPUS-V1.0/Firmware/RepRapFirmware/RRFBuild-SourceCode/CoreN2G/src/atmel/SAME51_DFP/1.1.139/atdf/ATSAME51G19A.atdf
          <instance name="TCC2">
            <register-group name="TCC2" name-in-module="TCC" address-space="base" offset="0x42000C00"/>
            <signals>
              <signal group="WO" index="0" function="F" pad="PA14" ioset="1"/>
              <signal group="WO" index="0" function="F" pad="PA30" ioset="2"/>
              <signal group="WO" index="1" function="F" pad="PA15" ioset="1"/>
              <signal group="WO" index="1" function="F" pad="PA31" ioset="2"/>
              <signal group="WO" index="2" function="F" pad="PA24" ioset="1"/>
              <signal group="WO" index="2" function="F" pad="PB02" ioset="2"/>
            </signals>
            <parameters>
              <param name="CC_NUM" value="3" caption="Number of Compare/Capture units"/>
              <param name="DITHERING" value="0" caption="Dithering feature implemented"/>
              <param name="DMAC_ID_OVF" value="34" caption="DMA overflow/underflow/retrigger trigger"/>
              <param name="DMAC_ID_MC0" value="35" caption="Indexes of DMA Match/Compare 0 trigger"/>
              <param name="DMAC_ID_MC1" value="36" caption="Indexes of DMA Match/Compare 1 trigger"/>
              <param name="DMAC_ID_MC2" value="37" caption="Indexes of DMA Match/Compare 2 trigger"/>
              <param name="DTI" value="0" caption="Dead-Time-Insertion feature implemented"/>
              <param name="EXT" value="1" caption="Coding of implemented extended features"/>
              <param name="GCLK_ID" value="29" caption="Index of Generic Clock"/>
              <param name="MASTER_SLAVE_MODE" value="0" caption="TCC type 0 : NA, 1 : Master, 2 : Slave"/>
              <param name="OTMX" value="1" caption="Output Matrix feature implemented"/>
              <param name="OW_NUM" value="3" caption="Number of Output Waveforms"/>
              <param name="PG" value="0" caption="Pattern Generation feature implemented"/>
              <param name="SIZE" value="16"/>
              <param name="SWAP" value="0" caption="DTI outputs swap feature implemented"/>
              <param name="INSTANCE_ID" value="67"/>
            </parameters>
          </instance>
        </module>
        <module name="TRNG" id="U2242" version="1.1.0">
          <instance name="TRNG">
            <register-group name="TRNG" name-in-module="TRNG" address-space="base" offset="0x42002800"/>
            <parameters>
              <param name="INSTANCE_ID" value="74"/>
            </parameters>
          </instance>
        </module>
        <module name="USB" id="U2222" version="1.2.0">
          <instance name="USB">
            <register-group name="USB" name-in-module="USB" address-space="base" offset="0x41000000"/>
            <signals>
              <signal group="DM" function="H" pad="PA24"/>
              <signal group="DP" function="H" pad="PA25"/>
              <signal group="SOF_1KHZ" function="H" pad="PA23" ioset="1"/>
              <signal group="SOF_1KHZ" function="H" pad="PB22" ioset="2"/>
            </signals>
            <parameters>
              <param name="AHB_2_USB_FIFO_DEPTH" value="4" caption="bytes number, should be at least 2, and 2^n (4,8,16 ...)"/>
              <param name="AHB_2_USB_RD_DATA_BITS" value="8" caption="8, 16 or 32, here : 8-bits is required as UTMI interface should work in 8-bits mode"/>
              <param name="AHB_2_USB_WR_DATA_BITS" value="32" caption="8, 16 or 32 : here, AHB transfer is made in word mode"/>
              <param name="AHB_2_USB_WR_THRESHOLD" value="2" caption="as soon as there are N bytes-free inside the fifo, ahb read transfer is requested"/>
              <param name="DATA_BUS_16_8" value="0" caption="UTMI/SIE data bus size : 0 -&gt; 8 bits, 1 -&gt; 16 bits"/>
              <param name="EPNUM" value="8" caption="parameter for rtl : max of ENDPOINT and PIPE NUM"/>
              <param name="EPT_NUM" value="8" caption="Number of USB end points"/>
              <param name="GCLK_ID" value="10" caption="Index of Generic Clock"/>
              <param name="INITIAL_CONTROL_QOS" value="3" caption="CONTROL QOS RESET value"/>
              <param name="INITIAL_DATA_QOS" value="3" caption="DATA QOS RESET value"/>
              <param name="MISSING_SOF_DET_IMPLEMENTED" value="1" caption="48 mHz xPLL feature implemented"/>
              <param name="PIPE_NUM" value="8" caption="Number of USB pipes"/>
              <param name="SYSTEM_CLOCK_IS_CKUSB" value="0" caption="Dual (1'b0) or Single (1'b1) clock system"/>
              <param name="USB_2_AHB_FIFO_DEPTH" value="4" caption="bytes number, should be at least 2, and 2^n (4,8,16 ...)"/>
              <param name="USB_2_AHB_RD_DATA_BITS" value="16" caption="8, 16 or 32, here : 8-bits is required as UTMI interface should work in 8-bits mode"/>
              <param name="USB_2_AHB_RD_THRESHOLD" value="2" caption="as soon as there are 16 bytes-free inside the fifo, ahb read transfer is requested"/>
              <param name="USB_2_AHB_WR_DATA_BITS" value="8" caption="8, 16 or 32 : here : 8-bits is required as UTMI interface should work in 8-bits mode"/>
              <param name="INSTANCE_ID" value="32"/>
            </parameters>
          </instance>
        </module>
        <module name="WDT" id="U2251" version="1.1.0">
          <instance name="WDT">
            <register-group name="WDT" name-in-module="WDT" address-space="base" offset="0x40002000"/>
            <parameters>
              <param name="INSTANCE_ID" value="8"/>
            </parameters>
          </instance>
        </module>
        <module name="CoreDebug" version="1.0.0">
          <instance name="CoreDebug">
            <register-group name="CoreDebug" name-in-module="CoreDebug" address-space="base" offset="0xE000EDF0"/>
          </instance>
        </module>
        <module name="DWT" version="1.0.0">
          <instance name="DWT">
            <register-group name="DWT" name-in-module="DWT" address-space="base" offset="0xE0001000"/>
          </instance>
        </module>
        <module name="ETM" version="1.0.0">
          <instance name="ETM">
            <register-group name="ETM" name-in-module="ETM" address-space="base" offset="0xE0041000"/>
