bigtreetech/BIGTREETECH-OCTOPUS-V1.0/Firmware/RepRapFirmware/RRFBuild-SourceCode/CoreN2G/src/atmel/SAME51_DFP/1.1.139/atdf/ATSAME51G19A.atdf
      <value-group name="NVMCTRL_CTRLB__CMDEX">
        <value name="KEY" caption="Execution Key" value="0xA5"/>
      </value-group>
      <value-group name="NVMCTRL_PARAM__PSZ">
        <value name="8" caption="8 bytes" value="0x0"/>
        <value name="16" caption="16 bytes" value="0x1"/>
        <value name="32" caption="32 bytes" value="0x2"/>
        <value name="64" caption="64 bytes" value="0x3"/>
        <value name="128" caption="128 bytes" value="0x4"/>
        <value name="256" caption="256 bytes" value="0x5"/>
        <value name="512" caption="512 bytes" value="0x6"/>
        <value name="1024" caption="1024 bytes" value="0x7"/>
      </value-group>
      <value-group name="NVMCTRL_PARAM__SEE">
        <value name="A" caption="163840 bytes" value="0xA"/>
        <value name="9" caption="147456 bytes" value="0x9"/>
        <value name="8" caption="131072 bytes" value="0x8"/>
        <value name="7" caption="114688 bytes" value="0x7"/>
        <value name="6" caption="98304 bytes" value="0x6"/>
        <value name="5" caption="81920 bytes" value="0x5"/>
        <value name="4" caption="65536 bytes" value="0x4"/>
        <value name="3" caption="49152 bytes" value="0x3"/>
        <value name="2" caption="32768 bytes" value="0x2"/>
        <value name="1" caption="16384 bytes" value="0x1"/>
        <value name="0" caption="0 bytes" value="0x0"/>
      </value-group>
      <value-group name="NVMCTRL_STATUS__BOOTPROT">
        <value name="0" caption="0 kbytes" value="0xF"/>
        <value name="8" caption="8 kbytes" value="0xE"/>
        <value name="16" caption="16 kbytes" value="0xD"/>
        <value name="24" caption="24 kbytes" value="0xC"/>
        <value name="32" caption="32 kbytes" value="0xB"/>
        <value name="40" caption="40 kbytes" value="0xA"/>
        <value name="48" caption="48 kbytes" value="0x9"/>
        <value name="56" caption="56 kbytes" value="0x8"/>
        <value name="64" caption="64 kbytes" value="0x7"/>
        <value name="72" caption="72 kbytes" value="0x6"/>
        <value name="80" caption="80 kbytes" value="0x5"/>
        <value name="88" caption="88 kbytes" value="0x4"/>
        <value name="96" caption="96 kbytes" value="0x3"/>
        <value name="104" caption="104 kbytes" value="0x2"/>
        <value name="112" caption="112 kbytes" value="0x1"/>
        <value name="120" caption="120 kbytes" value="0x0"/>
      </value-group>
      <value-group name="NVMCTRL_ECCERR__TYPEH">
        <value name="None" caption="No Error Detected Since Last Read" value="0"/>
        <value name="Single" caption="At Least One Single Error Detected Since last Read" value="1"/>
        <value name="Dual" caption="At Least One Dual Error Detected Since Last Read" value="2"/>
      </value-group>
      <value-group name="NVMCTRL_ECCERR__TYPEL">
        <value name="None" caption="No Error Detected Since Last Read" value="0"/>
        <value name="Single" caption="At Least One Single Error Detected Since last Read" value="1"/>
        <value name="Dual" caption="At Least One Dual Error Detected Since Last Read" value="2"/>
      </value-group>
      <value-group name="NVMCTRL_SEECFG__WMODE">
        <value name="UNBUFFERED" caption="A NVM write command is issued after each write in the pagebuffer" value="0"/>
        <value name="BUFFERED" caption="A NVM write command is issued when a write to a new page is requested" value="1"/>
      </value-group>
    </module>
    <module name="FUSES" id="U2409" version="1.0.0" caption="Non-Volatile Fuses">
      <register-group name="SW0_FUSES">
        <register name="SW0_WORD_0" offset="0x0" size="4" rw="R" caption="SW0 Page Word 0">
          <bitfield name="AC_BIAS0" caption="PAIR0 Bias Calibration" mask="0x3"/>
          <bitfield name="ADC0_BIASCOMP" caption="ADC Comparator Scaling" mask="0x1C"/>
          <bitfield name="ADC0_BIASREFBUF" caption="ADC Bias Reference Buffer Scaling" mask="0xE0"/>
          <bitfield name="ADC0_BIASR2R" caption="ADC Bias R2R ampli scaling" mask="0x700"/>
          <bitfield name="ADC1_BIASCOMP" caption="ADC Comparator Scaling" mask="0x70000"/>
          <bitfield name="ADC1_BIASREFBUF" caption="ADC Bias Reference Buffer Scaling" mask="0x380000"/>
          <bitfield name="ADC1_BIASR2R" caption="ADC Bias R2R ampli scaling" mask="0x1C00000"/>
        </register>
        <register name="SW0_WORD_1" offset="0x4" size="4" rw="R" caption="SW0 Page Word 1">
          <bitfield name="USB_TRANSN" caption="USB pad Transn calibration" mask="0x1F"/>
          <bitfield name="USB_TRANSP" caption="USB pad Transp calibration" mask="0x3E0"/>
          <bitfield name="USB_TRIM" caption="USB pad Trim calibration" mask="0x1C00"/>
        </register>
      </register-group>
      <register-group name="TEMP_LOG_FUSES">
        <register name="TEMP_LOG_WORD_0" offset="0x0" size="4" rw="R" caption="TEMP_LOG Page Word 0">
          <bitfield name="ROOM_TEMP_VAL_INT" caption="Integer part of room temperature in oC" mask="0xFF"/>
          <bitfield name="ROOM_TEMP_VAL_DEC" caption="Decimal part of room temperature" mask="0xF00"/>
          <bitfield name="HOT_TEMP_VAL_INT" caption="Integer part of hot temperature in oC" mask="0xFF000"/>
          <bitfield name="HOT_TEMP_VAL_DEC" caption="Decimal part of hot temperature" mask="0xF00000"/>
          <bitfield name="ROOM_INT1V_VAL" caption="2's complement of the internal 1V reference drift at room temperature (versus a 1.0 centered value)" mask="0xFF000000"/>
        </register>
        <register name="TEMP_LOG_WORD_1" offset="0x4" size="4" rw="R" caption="TEMP_LOG Page Word 1">
          <bitfield name="HOT_INT1V_VAL" caption="2's complement of the internal 1V reference drift at hot temperature (versus a 1.0 centered value)" mask="0xFF"/>
          <bitfield name="ROOM_ADC_VAL_PTAT" caption="12-bit ADC conversion at room temperature PTAT" mask="0xFFF00"/>
          <bitfield name="HOT_ADC_VAL_PTAT" caption="12-bit ADC conversion at hot temperature PTAT" mask="0xFFF00000"/>
        </register>
        <register name="TEMP_LOG_WORD_2" offset="0x8" size="4" rw="R" caption="TEMP_LOG Page Word 2">
          <bitfield name="ROOM_ADC_VAL_CTAT" caption="12-bit ADC conversion at room temperature CTAT" mask="0xFFF"/>
          <bitfield name="HOT_ADC_VAL_CTAT" caption="12-bit ADC conversion at hot temperature CTAT" mask="0xFFF000"/>
        </register>
      </register-group>
      <register-group name="USER_FUSES">
        <register name="USER_WORD_0" offset="0x0" size="4" rw="RW" caption="USER Page Word 0">
          <bitfield name="BOD33_DIS" caption="BOD33 Disable" mask="0x1"/>
          <bitfield name="BOD33USERLEVEL" caption="BOD33 User Level" mask="0x1FE"/>
          <bitfield name="BOD33_ACTION" caption="BOD33 Action" mask="0x600" values="SUPC_BOD33__ACTION"/>
          <bitfield name="BOD33_HYST" caption="BOD33 Hysteresis" mask="0x7800"/>
          <bitfield name="NVMCTRL_BOOTPROT" caption="Bootloader Size" mask="0x3C000000" values="NVMCTRL_STATUS__BOOTPROT"/>
        </register>
        <register name="USER_WORD_1" offset="0x4" size="4" rw="RW" caption="USER Page Word 1">
          <bitfield name="NVMCTRL_SEESBLK" caption="Number Of Physical NVM Blocks Composing a SmartEEPROM Sector" mask="0xF"/>
          <bitfield name="NVMCTRL_SEEPSZ" caption="Size Of SmartEEPROM Page" mask="0x70"/>
          <bitfield name="RAMECC_ECCDIS" caption="RAM ECC Disable fuse" mask="0x80"/>
          <bitfield name="WDT_ENABLE" caption="WDT Enable" mask="0x10000"/>
          <bitfield name="WDT_ALWAYSON" caption="WDT Always On" mask="0x20000"/>
          <bitfield name="WDT_PER" caption="WDT Period" mask="0x3C0000" values="WDT_CONFIG__PER"/>
          <bitfield name="WDT_WINDOW" caption="WDT Window" mask="0x3C00000" values="WDT_CONFIG__WINDOW"/>
          <bitfield name="WDT_EWOFFSET" caption="WDT Early Warning Offset" mask="0x3C000000" values="WDT_EWCTRL__EWOFFSET"/>
          <bitfield name="WDT_WEN" caption="WDT Window Mode Enable" mask="0x40000000"/>
        </register>
        <register name="USER_WORD_2" offset="0x8" size="4" rw="RW" caption="USER Page Word 2">
          <bitfield name="NVMCTRL_REGION_LOCKS" caption="NVM Region Locks" mask="0xFFFFFFFF"/>
        </register>
      </register-group>
      <value-group name="SUPC_BOD33__ACTION">
        <value name="NONE" caption="No action" value="0x0"/>
        <value name="RESET" caption="The BOD33 generates a reset" value="0x1"/>
        <value name="INT" caption="The BOD33 generates an interrupt" value="0x2"/>
        <value name="BKUP" caption="The BOD33 puts the device in backup sleep mode" value="0x3"/>
      </value-group>
      <value-group name="NVMCTRL_STATUS__BOOTPROT">
        <value name="0" caption="0 kbytes" value="0xF"/>
        <value name="8" caption="8 kbytes" value="0xE"/>
        <value name="16" caption="16 kbytes" value="0xD"/>
        <value name="24" caption="24 kbytes" value="0xC"/>
        <value name="32" caption="32 kbytes" value="0xB"/>
        <value name="40" caption="40 kbytes" value="0xA"/>
        <value name="48" caption="48 kbytes" value="0x9"/>
        <value name="56" caption="56 kbytes" value="0x8"/>
        <value name="64" caption="64 kbytes" value="0x7"/>
        <value name="72" caption="72 kbytes" value="0x6"/>
        <value name="80" caption="80 kbytes" value="0x5"/>
        <value name="88" caption="88 kbytes" value="0x4"/>
        <value name="96" caption="96 kbytes" value="0x3"/>
        <value name="104" caption="104 kbytes" value="0x2"/>
        <value name="112" caption="112 kbytes" value="0x1"/>
        <value name="120" caption="120 kbytes" value="0x0"/>
      </value-group>
      <value-group name="WDT_CONFIG__PER">
        <value name="CYC8" caption="8 clock cycles" value="0x0"/>
        <value name="CYC16" caption="16 clock cycles" value="0x1"/>
        <value name="CYC32" caption="32 clock cycles" value="0x2"/>
        <value name="CYC64" caption="64 clock cycles" value="0x3"/>
        <value name="CYC128" caption="128 clock cycles" value="0x4"/>
        <value name="CYC256" caption="256 clock cycles" value="0x5"/>
        <value name="CYC512" caption="512 clock cycles" value="0x6"/>
        <value name="CYC1024" caption="1024 clock cycles" value="0x7"/>
        <value name="CYC2048" caption="2048 clock cycles" value="0x8"/>
        <value name="CYC4096" caption="4096 clock cycles" value="0x9"/>
        <value name="CYC8192" caption="8192 clock cycles" value="0xA"/>
        <value name="CYC16384" caption="16384 clock cycles" value="0xB"/>
      </value-group>
