bigtreetech/BIGTREETECH-OCTOPUS-V1.0/Firmware/RepRapFirmware/RRFBuild-SourceCode/CoreN2G/src/atmel/SAME51_DFP/1.1.139/atdf/ATSAME51G19A.atdf
        <register name="DFLLCTRLB" offset="0x20" rw="RW" access="RSYNC" size="1" initval="0x00" caption="DFLL48M Control B">
          <bitfield name="MODE" caption="Operating Mode Selection" mask="0x1"/>
          <bitfield name="STABLE" caption="Stable DFLL Frequency" mask="0x2"/>
          <bitfield name="LLAW" caption="Lose Lock After Wake" mask="0x4"/>
          <bitfield name="USBCRM" caption="USB Clock Recovery Mode" mask="0x8"/>
          <bitfield name="CCDIS" caption="Chill Cycle Disable" mask="0x10"/>
          <bitfield name="QLDIS" caption="Quick Lock Disable" mask="0x20"/>
          <bitfield name="BPLCKC" caption="Bypass Coarse Lock" mask="0x40"/>
          <bitfield name="WAITLOCK" caption="Wait Lock" mask="0x80"/>
        </register>
        <register name="DFLLVAL" offset="0x24" rw="RW" access="RWSYNC" size="4" initval="0x00000000" caption="DFLL48M Value">
          <bitfield name="FINE" caption="Fine Value" mask="0xFF"/>
          <bitfield name="COARSE" caption="Coarse Value" mask="0xFC00"/>
          <bitfield name="DIFF" caption="Multiplication Ratio Difference" mask="0xFFFF0000"/>
        </register>
        <register name="DFLLMUL" offset="0x28" rw="RW" access="WSYNC" size="4" initval="0x00000000" caption="DFLL48M Multiplier">
          <bitfield name="MUL" caption="DFLL Multiply Factor" mask="0xFFFF"/>
          <bitfield name="FSTEP" caption="Fine Maximum Step" mask="0xFF0000"/>
          <bitfield name="CSTEP" caption="Coarse Maximum Step" mask="0xFC000000"/>
        </register>
        <register name="DFLLSYNC" offset="0x2C" rw="RW" size="1" initval="0x00" caption="DFLL48M Synchronization">
          <bitfield name="ENABLE" caption="ENABLE Synchronization Busy" mask="0x2"/>
          <bitfield name="DFLLCTRLB" caption="DFLLCTRLB Synchronization Busy" mask="0x4"/>
          <bitfield name="DFLLVAL" caption="DFLLVAL Synchronization Busy" mask="0x8"/>
          <bitfield name="DFLLMUL" caption="DFLLMUL Synchronization Busy" mask="0x10"/>
        </register>
        <register-group name="DPLL" name-in-module="DPLL" offset="0x30" size="0x14" count="2"/>
      </register-group>
      <value-group name="OSCCTRL_XOSCCTRL__STARTUP">
        <value name="CYCLE1" caption="31 us" value="0"/>
        <value name="CYCLE2" caption="61 us" value="1"/>
        <value name="CYCLE4" caption="122 us" value="2"/>
        <value name="CYCLE8" caption="244 us" value="3"/>
        <value name="CYCLE16" caption="488 us" value="4"/>
        <value name="CYCLE32" caption="977 us" value="5"/>
        <value name="CYCLE64" caption="1953 us" value="6"/>
        <value name="CYCLE128" caption="3906 us" value="7"/>
        <value name="CYCLE256" caption="7813 us" value="8"/>
        <value name="CYCLE512" caption="15625 us" value="9"/>
        <value name="CYCLE1024" caption="31250 us" value="10"/>
        <value name="CYCLE2048" caption="62500 us" value="11"/>
        <value name="CYCLE4096" caption="125000 us" value="12"/>
        <value name="CYCLE8192" caption="250000 us" value="13"/>
        <value name="CYCLE16384" caption="500000 us" value="14"/>
        <value name="CYCLE32768" caption="1000000 us" value="15"/>
      </value-group>
      <value-group name="OSCCTRL_XOSCCTRL__CFDPRESC">
        <value name="DIV1" caption="48 MHz" value="0"/>
        <value name="DIV2" caption="24 MHz" value="1"/>
        <value name="DIV4" caption="12 MHz" value="2"/>
        <value name="DIV8" caption="6 MHz" value="3"/>
        <value name="DIV16" caption="3 MHz" value="4"/>
        <value name="DIV32" caption="1.5 MHz" value="5"/>
        <value name="DIV64" caption="0.75 MHz" value="6"/>
        <value name="DIV128" caption="0.3125 MHz" value="7"/>
      </value-group>
      <value-group name="OSCCTRL_DPLLCTRLB__LTIME">
        <value name="DEFAULT" caption="No time-out. Automatic lock" value="0x0"/>
        <value name="800US" caption="Time-out if no lock within 800us" value="0x4"/>
        <value name="900US" caption="Time-out if no lock within 900us" value="0x5"/>
        <value name="1MS" caption="Time-out if no lock within 1ms" value="0x6"/>
        <value name="1P1MS" caption="Time-out if no lock within 1.1ms" value="0x7"/>
      </value-group>
      <value-group name="OSCCTRL_DPLLCTRLB__FILTER">
        <value name="FILTER1" caption="Bandwidth = 92.7Khz and Damping Factor = 0.76" value="0"/>
        <value name="FILTER2" caption="Bandwidth = 131Khz and Damping Factor = 1.08" value="1"/>
        <value name="FILTER3" caption="Bandwidth = 46.4Khz and Damping Factor = 0.38" value="2"/>
        <value name="FILTER4" caption="Bandwidth = 65.6Khz and Damping Factor = 0.54" value="3"/>
        <value name="FILTER5" caption="Bandwidth = 131Khz and Damping Factor = 0.56" value="4"/>
        <value name="FILTER6" caption="Bandwidth = 185Khz and Damping Factor = 0.79" value="5"/>
        <value name="FILTER7" caption="Bandwidth = 65.6Khz and Damping Factor = 0.28" value="6"/>
        <value name="FILTER8" caption="Bandwidth = 92.7Khz and Damping Factor = 0.39" value="7"/>
        <value name="FILTER9" caption="Bandwidth = 46.4Khz and Damping Factor = 1.49" value="8"/>
        <value name="FILTER10" caption="Bandwidth = 65.6Khz and Damping Factor = 2.11" value="9"/>
        <value name="FILTER11" caption="Bandwidth = 23.2Khz and Damping Factor = 0.75" value="10"/>
        <value name="FILTER12" caption="Bandwidth = 32.8Khz and Damping Factor = 1.06" value="11"/>
        <value name="FILTER13" caption="Bandwidth = 65.6Khz and Damping Factor = 1.07" value="12"/>
        <value name="FILTER14" caption="Bandwidth = 92.7Khz and Damping Factor = 1.51" value="13"/>
        <value name="FILTER15" caption="Bandwidth = 32.8Khz and Damping Factor = 0.53" value="14"/>
        <value name="FILTER16" caption="Bandwidth = 46.4Khz and Damping Factor = 0.75" value="15"/>
      </value-group>
      <value-group name="OSCCTRL_DPLLCTRLB__DCOFILTER">
        <value name="FILTER1" caption="Capacitor(pF) = 0.5 and Bandwidth Fn (MHz) = 3.21" value="0"/>
        <value name="FILTER2" caption="Capacitor(pF) = 1 and Bandwidth Fn (MHz) = 1.6" value="1"/>
        <value name="FILTER3" caption="Capacitor(pF) = 1.5 and Bandwidth Fn (MHz) = 1.1" value="2"/>
        <value name="FILTER4" caption="Capacitor(pF) = 2 and Bandwidth Fn (MHz) = 0.8" value="3"/>
        <value name="FILTER5" caption="Capacitor(pF) = 2.5 and Bandwidth Fn (MHz) = 0.64" value="4"/>
        <value name="FILTER6" caption="Capacitor(pF) = 3 and Bandwidth Fn (MHz) = 0.55" value="5"/>
        <value name="FILTER7" caption="Capacitor(pF) = 3.5 and Bandwidth Fn (MHz) = 0.45" value="6"/>
        <value name="FILTER8" caption="Capacitor(pF) = 4 and Bandwidth Fn (MHz) = 0.4" value="7"/>
      </value-group>
      <value-group name="OSCCTRL_DPLLCTRLB__REFCLK">
        <value name="GCLK" caption="Dedicated GCLK clock reference" value="0x0"/>
        <value name="XOSC32" caption="XOSC32K clock reference" value="0x1"/>
        <value name="XOSC0" caption="XOSC0 clock reference" value="0x2"/>
        <value name="XOSC1" caption="XOSC1 clock reference" value="0x3"/>
      </value-group>
    </module>
    <module name="OSC32KCTRL" id="U2400" version="1.0.0" caption="32kHz Oscillators Control">
      <register-group name="OSC32KCTRL" caption="32kHz Oscillators Control">
        <register name="INTENCLR" offset="0x0" rw="RW" size="4" atomic-op="clear:INTENCLR" initval="0x00000000" caption="Interrupt Enable Clear">
          <bitfield name="XOSC32KRDY" caption="XOSC32K Ready Interrupt Enable" mask="0x1"/>
          <bitfield name="XOSC32KFAIL" caption="XOSC32K Clock Failure Detector Interrupt Enable" mask="0x4"/>
        </register>
